test/cwmp_builder_SUITE_data/cwmp_Inform.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:cwmp="urn:dslforum-org:cwmp-1-0"><soapenv:Header/><soapenv:Body><cwmp:Inform><cwmp:DeviceIdStruct><Manufacturer>Alcatel</Manufacturer><OUI>001D4C</OUI><ProductClass>9365 BSR Femto</ProductClass><SerialNumber>4321</SerialNumber></cwmp:DeviceIdStruct><EventList soapenc:arrayType="cwmp:EventStruct[1]"><cwmp:EventStruct><EventCodeType>2</EventCodeType><CommandKeyType/></cwmp:EventStruct></EventList><MaxEnvelopes>1</MaxEnvelopes><CurrentTime>2012-10-03T18:16:02Z</CurrentTime><RetryCount>0</RetryCount><ParameterValueList soapenc:arrayType="cwmp:ParameterValueStruct[10]"><cwmp:ParameterValueStruct><Name>Device.DeviceSummary</Name><Value>DeviceSummary</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.DeviceInfo.HardwareVersion</Name><Value>p1</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.DeviceInfo.SoftwareVersion</Name><Value>BCR-04-00-BSR-XMIM-06.01</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.ManagementServer.ConnectionRequestURL</Name><Value>&amp;sn=4321http://127.0.0.1:8095/ConnectionRequest?command=cr</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.ManagementServer.ParameterKey</Name><Value>ParameterKey</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.LAN.IPAddress</Name><Value>172.0.0.1</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.LAN.MACAddress</Name><Value>00-0E-35-D6-24-F7</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.Services.BSR.1.SDM.1.mimVersion</Name><Value>BCR-04-00-BSR-XMIM-02.00</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.DeviceInfo.AdditionalHardwareVersion</Name><Value>250mW</Value></cwmp:ParameterValueStruct><cwmp:ParameterValueStruct><Name>Device.Services.BSR.1.RFTrace.1.iMSI</Name><Value>iMSI</Value></cwmp:ParameterValueStruct></ParameterValueList></cwmp:Inform></soapenv:Body></soapenv:Envelope>